Ran Plan for dir: `Terraform/Project/infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.public_instance[0] will be created
+ resource "yandex_compute_instance" "public_instance" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys"  = (sensitive value)
          + "user-data" = <<-EOT
                #cloud-config
                package_update: true
                package_upgrade: false
                packages:
                  - mc
                  - git
                  - apt-transport-https
                  - ca-certificates
                  - curl
                  - gnupg
                  - lsb-release
                  - unattended-upgrades
                
                runcmd:
                  - usermod -aG sudo user7
                  - echo 'user7 ALL=(ALL) NOPASSWD:ALL' > /etc/sudoers.d/user7
                  - chmod 440 /etc/sudoers.d/user7
                  - visudo -cf /etc/sudoers.d/user7
                  - usermod -s /usr/sbin/nologin ubuntu
                  - echo 'DenyUsers ubuntu' >> /etc/ssh/sshd_config
                  - systemctl restart sshd
                  - curl -fsSL -o get_helm.sh https://raw.githubusercontent.com/helm/helm/main/scripts/get-helm-3
                  - chmod 700 get_helm.sh
                  - ./get_helm.sh
                  - ufw disable
                  - iptables -F
                  - iptables -X
                  - iptables -t nat -F
                  - iptables -t nat -X
                  - iptables -t mangle -F
                  - iptables -t mangle -X
                  - iptables -P INPUT ACCEPT
                  - iptables -P FORWARD ACCEPT
                  - iptables -P OUTPUT ACCEPT
            EOT
        }
      + name                      = "public-instance-1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd88ihfqlolga7mj8is9"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.10.250"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy (known after apply)
    }

  # yandex_compute_instance.public_instance[1] will be created
+ resource "yandex_compute_instance" "public_instance" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys"  = (sensitive value)
          + "user-data" = <<-EOT
                #cloud-config
                package_update: true
                package_upgrade: false
                packages:
                  - mc
                  - git
                  - apt-transport-https
                  - ca-certificates
                  - curl
                  - gnupg
                  - lsb-release
                  - unattended-upgrades
                
                runcmd:
                  - usermod -aG sudo user7
                  - echo 'user7 ALL=(ALL) NOPASSWD:ALL' > /etc/sudoers.d/user7
                  - chmod 440 /etc/sudoers.d/user7
                  - visudo -cf /etc/sudoers.d/user7
                  - usermod -s /usr/sbin/nologin ubuntu
                  - echo 'DenyUsers ubuntu' >> /etc/ssh/sshd_config
                  - systemctl restart sshd
                  - curl -fsSL -o get_helm.sh https://raw.githubusercontent.com/helm/helm/main/scripts/get-helm-3
                  - chmod 700 get_helm.sh
                  - ./get_helm.sh
                  - ufw disable
                  - iptables -F
                  - iptables -X
                  - iptables -t nat -F
                  - iptables -t nat -X
                  - iptables -t mangle -F
                  - iptables -t mangle -X
                  - iptables -P INPUT ACCEPT
                  - iptables -P FORWARD ACCEPT
                  - iptables -P OUTPUT ACCEPT
            EOT
        }
      + name                      = "public-instance-2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd88ihfqlolga7mj8is9"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.251"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy (known after apply)
    }

  # yandex_compute_instance.public_instance[2] will be created
+ resource "yandex_compute_instance" "public_instance" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys"  = (sensitive value)
          + "user-data" = <<-EOT
                #cloud-config
                package_update: true
                package_upgrade: false
                packages:
                  - mc
                  - git
                  - apt-transport-https
                  - ca-certificates
                  - curl
                  - gnupg
                  - lsb-release
                  - unattended-upgrades
                
                runcmd:
                  - usermod -aG sudo user7
                  - echo 'user7 ALL=(ALL) NOPASSWD:ALL' > /etc/sudoers.d/user7
                  - chmod 440 /etc/sudoers.d/user7
                  - visudo -cf /etc/sudoers.d/user7
                  - usermod -s /usr/sbin/nologin ubuntu
                  - echo 'DenyUsers ubuntu' >> /etc/ssh/sshd_config
                  - systemctl restart sshd
                  - curl -fsSL -o get_helm.sh https://raw.githubusercontent.com/helm/helm/main/scripts/get-helm-3
                  - chmod 700 get_helm.sh
                  - ./get_helm.sh
                  - ufw disable
                  - iptables -F
                  - iptables -X
                  - iptables -t nat -F
                  - iptables -t nat -X
                  - iptables -t mangle -F
                  - iptables -t mangle -X
                  - iptables -P INPUT ACCEPT
                  - iptables -P FORWARD ACCEPT
                  - iptables -P OUTPUT ACCEPT
            EOT
        }
      + name                      = "public-instance-3"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd88ihfqlolga7mj8is9"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.30.252"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 3
        }

      + scheduling_policy (known after apply)
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "my-vpc"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet1 will be created
+ resource "yandex_vpc_subnet" "subnet1" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-1"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet2 will be created
+ resource "yandex_vpc_subnet" "subnet2" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-2"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet3 will be created
+ resource "yandex_vpc_subnet" "subnet3" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-3"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.30.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instances_info = [
      + {
          + private_ip = "192.168.10.250"
          + public_ip  = (known after apply)
        },
      + {
          + private_ip = "192.168.20.251"
          + public_ip  = (known after apply)
        },
      + {
          + private_ip = "192.168.30.252"
          + public_ip  = (known after apply)
        },
    ]
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d Terraform/Project/infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://62.84.127.152:4141/lock?id=IvanChet-4%252FDevOps_D%252FTerraform%252FProject%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d Terraform/Project/infrastructure
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```